In [1]:
import pandas as pd
import numpy as np

In [2]:
dfs = pd.read_csv(r'C:\Users\Jagatheesh\OneDrive\Desktop\Heriot_Watt_University_Msc_Data_Science\Data_Viz_CW2\Cost_of_living_crisis_UK_Storyboard\Resources\DataSet\HousePriceIndex.csv')
pd.options.display.float_format = '{:.2f}'.format

In [3]:
dfs['year']=dfs['Date'].apply(lambda x:x[-4:])
dfs=dfs[dfs['year'].isin(['2020','2021','2022'])]
final=dfs[['RegionName','AveragePrice']].groupby('RegionName').mean().sort_values(by='AveragePrice',ascending=False)

In [4]:
final['RegionName']=final.index
final.index=[x for x in range(0,len(final))]

In [5]:
for i in final['RegionName'].unique():
    if 'midlands' in str.lower(i):
        print(i)

West Midlands Region
East Midlands
West Midlands

In [6]:
regions=['Wales',
'Scotland',
'Northern Ireland',
'South West',
'South East',
'London',
'East',
'West Midlands',
'East Midlands',
'Yorkshire and the Humber',
'North West',
'North East']

In [7]:
map_data=final[final['RegionName'].isin(regions)].reset_index(drop=True)
map_data

   AveragePrice        RegionName
0     494927.39            London
1     342554.25        South East
2     278018.08        South West
3     210887.47     East Midlands
4     198480.45     West Midlands
5     181632.58        North West
6     181475.89             Wales
7     165224.37          Scotland
8     149687.74  Northern Ireland
9     138452.78        North East

In [8]:
map_data.rename(columns={'AveragePrice':'MedianPrice'},inplace=True)
map_data.to_csv('housepriceregion.csv')